export const NOTES = [
  {
    title: null,
    _id: '5e81b36d50b35125fc9ded6b',
    text: 'это тестовая заметка без заголовка',
    date: '2020-03-30T08:53:01.154Z',
    user: '5e39158f712c5c2056e6e743'
  },
  {
    title: 'а это ее заголовок',
    _id: '5e81b38650b35125fc9ded6c',
    text: 'это тестовая заметка с заголовком',
    date: '2020-03-30T08:53:26.925Z',
    user: '5e39158f712c5c2056e6e743'
  },
  {
    title: null,
    _id: '5e81b3a850b35125fc9ded6d',
    text: 'это еще одна тестовая заметка чтобы была',
    date: '2020-03-30T08:54:00.736Z',
    user: '5e39158f712c5c2056e6e743'
  }
];
