export const TASKS = [
  {
    description: 'сделать их отдельным компонентом или диррективой в ui-kit',
    done: false,
    _id: '5e7484ac8bb00c23073935ee',
    tytle: 'добавить попапы везде где можно',
    date: '2020-03-20T08:54:04.083Z',
    user: '5e39158f712c5c2056e6e743'
  },
  {
    description: null,
    done: false,
    _id: '5e7486018bb00c23073935f2',
    tytle: 'внедрить ngrx',
    date: '2020-03-20T08:59:45.995Z',
    user: '5e39158f712c5c2056e6e743'
  },
  {
    description: null,
    done: false,
    _id: '5e74864b8bb00c23073935f4',
    tytle: 'сделать дозагрузку контента при прокрутке',
    date: '2020-03-20T09:00:59.397Z',
    user: '5e39158f712c5c2056e6e743'
  },
  {
    description: null,
    done: false,
    _id: '5e74d0991c0231062eb4ab9d',
    tytle: 'сделать прикрепление задачи к существующей, ',
    date: '2020-03-20T14:18:01.200Z',
    user: '5e39158f712c5c2056e6e743'
  },
  {
    description: 'приоритетные задачи выводятся всегда отдельным списком вверху экрана',
    done: false,
    _id: '5e7c5dd51af45f2191b13d35',
    tytle: 'Добавить приоритетные задачи',
    date: '2020-03-26T07:46:29.156Z',
    user: '5e39158f712c5c2056e6e743'
  },
  {
    description:
      '1 Все задачи↵2 Задачи на сегодня↵3 Задачи на определенный день↵4 при выбранном фильтре всех задач разделять их по датам',
    done: false,
    _id: '5e7c5e5f1af45f2191b13d36',
    tytle: 'добавить фильтрацию задач',
    date: '2020-03-26T07:48:47.634Z',
    user: '5e39158f712c5c2056e6e743'
  },
  {
    description:
      'список выводится в описании в виде чекбоксов↵добавляется по одному пункту через кнопку "добавить пункт"',
    done: false,
    _id: '5e7c5f161af45f2191b13d37',
    tytle: 'добавить прикрепление выполняемого списка к задаче',
    date: '2020-03-26T07:51:50.474Z',
    user: '5e39158f712c5c2056e6e743'
  },
  {
    description: 'по умолчанию ставить без даты↵',
    done: false,
    _id: '5e7c60241af45f2191b13d38',
    tytle: 'внедрить привязку даты выполнения задания',
    date: '2020-03-26T07:56:20.881Z',
    user: '5e39158f712c5c2056e6e743'
  },
  {
    description: 'задачи без даты выполнения выводятся отдельным списком после приоритетных',
    done: false,
    _id: '5e7c607f1af45f2191b13d39',
    tytle: 'добавить список для задач без даты',
    date: '2020-03-26T07:57:51.057Z',
    user: '5e39158f712c5c2056e6e743'
  },
  {
    description: null,
    done: false,
    _id: '5e7c642e1af45f2191b13d3a',
    tytle: 'изучить и написать юнит-тесты',
    date: '2020-03-26T08:13:34.323Z',
    user: '5e39158f712c5c2056e6e743'
  }
];

export function getTasks(index?: number): any {
  const tasks = TASKS.concat([]);
  return typeof index === 'number' ? tasks[index] : tasks;
}
